app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def index
        @comment = Comment.new
        @article = Article.find(params[:article_id])